import './App.css';
import MenuCreateBurger from './components/MenuCreateBurger/MenuCreateBurger';


function App() {
  return (
    <div className="App">
      <MenuCreateBurger/>
    </div>
  );
}

export default App;


// Мережа фастфудів пропонує кілька видів гамбургерів:

// маленький (50 тугриків, 20 калорій);
// великий (100 тугриків, 40 калорій).


// Гамбургер може бути з одним із декількох видів начинок:

// сиром (+ 10 тугриків, + 20 калорій);
// салатом (+ 20 тугриків, + 5 калорій);
// картоплею (+ 15 тугриків, + 10 калорій).


// Можна додати добавки:

// посипати приправою (+15 тугриків, 0 калорій) - полити майонезом (+ 20 тугриків, +5 калорій).


// Напишіть програму, яка розраховує вартість та калорійність гамбургера.



// Использовать React. useReducer